#include <stdio.h>


int main(void)
{
	// ** 주석 : 컴퓨터가 코드로 인식하지 않음.

	// 한줄 주석

	/*
		여러줄에 걸처 사용하는 주석
	*/


	/****************************************************
	* [자료형]
	* 
	** 정수
	* char	= 1byte  [네이버 -> [아스키코드 표] 검색]
	* short	= 2byte  
	* int	= 4byte
	* long	= 4byte
	* 
	** 실수
	* float		= 4byte
	* double	= 8byte
	*****************************************************/

	// ** [+] 더하기
	// ** [-] 빼기
	// ** [*] 곱하기
	// ** [/] 나누기
	// ** [%] 나머지

	// ** [=] 대입연산자

	
	
	
	// ** [.] 닷
	// ** [,] 콤마
	// ** [:] 콜론
	// ** [;] 세미콜론


	// ** 문자와 문자열의 표현
	// ** [''] 문자
	// ** [""] 문자열


	// ** 단항 연산의 표현
	// ** [*] 에스터리스크
	// ** [&] 엠퍼센트


	// ** ()  소괄호
	// ** {}  중괄호
	// ** []  대괄호


	// ** 논리연산의 표현
	// ** [&]  AND
	// ** [|]  OR
	// ** [^]  XOR
	// ** [!]  NOT


	return 0;  
}